[
  {
    "id": 234,
    "name": "Ball Fetch",
    "description": "If the Pokémon is not holding an item, it will fetch the Poké Ball from the first failed throw of the battle."
  },
  {
    "id": 235,
    "name": "Cotton Down",
    "description": "When the Pokémon is hit by an attack, it scatters cotton fluff around and lowers the Speed stat of all Pokémon except itself."
  },
  {
    "id": 236,
    "name": "Dauntless Shield",
    "description": "Boosts the Pokémon's Defense stat when the Pokémon enters a battle."
  },
  {
    "id": 237,
    "name": "Gorilla Tactics",
    "description": "Boosts the Pokémon's Attack stat but only allows the use of the first selected move."
  },
  {
    "id": 238,
    "name": "Gulp Missile",
    "description": "When the Pokémon uses Surf or Dive, it will come back with prey. When it takes damage, it will spit out the prey to attack."
  },
  {
    "id": 239,
    "name": "Hunger Switch",
    "description": "The Pokémon changes its form, alternating between its Full Belly Mode and Hangry Mode after the end of each turn."
  },
  {
    "id": 240,
    "name": "Ice Face",
    "description": "The Pokémon's ice head can take a physical attack as a substitute, but the attack also changes the Pokémon's appearance. The ice will be restored when it hails."
  },
  {
    "id": 241,
    "name": "Ice Scales",
    "description": "The Pokémon is protected by ice scales, which halve the damage taken from special moves."
  },
  {
    "id": 242,
    "name": "Intrepid Sword",
    "description": "Boosts the Pokémon's Attack stat when the Pokémon enters a battle."
  },
  {
    "id": 243,
    "name": "Libero",
    "description": "Changes the Pokémon's type to the type of the move it's about to use."
  },
  {
    "id": 244,
    "name": "Mimicry",
    "description": "Changes the Pokémon's type depending on the terrain."
  },
  {
    "id": 245,
    "name": "Mirror Armor",
    "description": "Bounces back only the stat-lowering effects that the Pokémon receives."
  },
  {
    "id": 246,
    "name": "Neutralizing Gas",
    "description": "If the Pokémon with Neutralizing Gas is in the battle, the effects of all Pokémon's Abilities will be nullified or will not be triggered."
  },
  {
    "id": 247,
    "name": "Pastel Veil",
    "description": "Protects the Pokémon and its ally Pokémon from being poisoned."
  },
  {
    "id": 248,
    "name": "Perish Body",
    "description": "When hit by a move that makes direct contact, the Pokémon and the attacker will faint after three turns unless they switch out of battle."
  },
  {
    "id": 249,
    "name": "Power Spot",
    "description": "Just being next to the Pokémon powers up moves."
  },
  {
    "id": 250,
    "name": "Propeller Tail",
    "description": "Ignores the effects of opposing Pokémon's Abilities and moves that draw in moves."
  },
  {
    "id": 251,
    "name": "Punk Rock",
    "description": "Boosts the power of sound-based moves. The Pokémon also takes half the damage from these kinds of moves."
  },
  {
    "id": 252,
    "name": "Ripen",
    "description": "Ripens Berries and doubles their effect."
  },
  {
    "id": 253,
    "name": "Sand Spit",
    "description": "The Pokémon creates a sandstorm when it's hit by an attack."
  },
  {
    "id": 254,
    "name": "Screen Cleaner",
    "description": "When the Pokémon enters a battle, the effects of Light Screen, Reflect, and Aurora Veil are nullified for both opposing and ally Pokémon."
  },
  {
    "id": 255,
    "name": "Stalwart",
    "description": "Ignores the effects of opposing Pokémon's Abilities and moves that draw in moves."
  },
  {
    "id": 256,
    "name": "Steam Engine",
    "description": "Boosts the Pokémon's Speed stat drastically if hit by a Fire- or Water-type move."
  },
  {
    "id": 257,
    "name": "Steely Spirit",
    "description": "Powers up ally Pokémon's Steel-type moves."
  },
  {
    "id": 258,
    "name": "Wandering Spirit",
    "description": "The Pokémon exchanges Abilities with a Pokémon that hits it with a move that makes direct contact."
  }
]
